rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','NC-17','R'))
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Aladdin"]]
---
  def same_director
    movie_entry_in_db = params[:id]
    @match = Movie.find(movie_entry_in_db)

    if @match.director == nil or @match.director == ''
      flash[:notice] = "'#{@match.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where("director in (?)", @match.director) || ''

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route


    #if params[:page] == "/movies/same_director" # find the movies that match the current director
    #                         # pass these movies into your same director view
    #  redirect_to movie_same_director_path, :my_director => @movie.director
    #end

    @movie = Movie.find(id) # look up movie by unique ID